"""
测试  # 3 -最重的主要词汇
背景
单词由52个字母组成，包括26个大写字母和26个小写字母，以及两种标点符号，连字符(-)
和撇号(')。

一个字母的重量是由它到字母表中字母A的距离决定的。 所以weight(a) = 0, weight(b) = 1… 重量(z) = 25。

一个大写字母的重量等于它的小写字母。 所以weight(a) = weight(a)

所有的标点符号都没有分量。

一个单词的重量是每个字母和标点符号的总和。 所以weight(cat) = 21, weight(I
'm) = 20。

质数词是其权重为质数的词，例如be，因为weight(be) = 5。

问题
你能找出If(拉迪亚德·吉卜林)中最沉重的3个启动词吗?

如果你能保持头脑清醒
失去理智，怪罪于你，
如果所有人都怀疑你，你仍能相信自己，
但也要体谅他们的怀疑;
如果你能等待而不因等待而厌倦，
或被骗，不要撒谎，
或被人憎恨，不要憎恨，
但不要看起来太好，也不要说得太聪明:

如果你有梦想，而不为梦所主宰;
如果你有思想，但又不以思想为目标;
如果你能同时面对胜利和灾难
对这两个骗子一视同仁;
如果你能忍受你所说的真相
被无赖扭曲，诱骗愚人，
或者看着你为之付出生命的事物破碎，
弯下腰，用破旧的工具把它们堆砌起来:

如果你能把赢来的钱堆在一起
冒着被抛来抛去的风险，
输了，再从头开始
对你的损失只字不提;
如果你能强迫你的心，神经和肌肉
在他们走后，服侍你自己，
当你一无所有时，请坚持下去
除了意志对他们说:“坚持住! ”

如果你与平民交谈而不失风度，
或与君王同行，也不失平易近人，
如果敌人和朋友都不能伤害你，
如果所有人都依赖你，但没有人过分依赖你;
如果你能填满这不可原谅的一分钟
60
秒的长跑，
你的世界和其中的一切，
更重要的是，我的孩子，你是个顶天立地的人!
请将您的答案和代码发送到 code@rippletek.com。 如果包含测试代码就太好了。

谢谢你！

"""